

#Область ОбработчикиСобытийЭлементовТаблицыФормыГрафикОтпусков

&НаКлиенте
Процедура ГрафикОтпусковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИмяЗначенияРеквизита = СтрЗаменить(Поле.Имя, "ГрафикОтпусков", "");
	
	ПоказатьЗначение(, Элементы.ГрафикОтпусков.ТекущиеДанные[ИмяЗначенияРеквизита]);

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)
	ЗаполнитьТаблицуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРассылку(Команда)
	ВыполнитьРассылкуНаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуНаСервере()
	
	ОбработкаОбъект_ = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект_.ЗаполнитьДокументыДляРассылки();
	ЗначениеВРеквизитФормы(ОбработкаОбъект_, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьРассылкуНаСервере()
	
	РеквизитФормыВЗначение("Объект").ВыполнитьРассылку();
	
	ЗаполнитьТаблицуНаСервере();
	
КонецПроцедуры

#КонецОбласти