

#Область ОбработчикиСобытийЭлементовТаблицыФормыГрафикОтпусков

&НаКлиенте
Процедура ГрафикОтпусковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИмяЗначенияРеквизита = СтрЗаменить(Поле.Имя, "ГрафикОтпусков", "");
	
	ПоказатьЗначение(, Элементы.ГрафикОтпусков.ТекущиеДанные[ИмяЗначенияРеквизита]);

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)
	ЗаполнитьТаблицуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРассылку(Команда)
	ВыполнитьРассылкуНаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуНаСервере()
	
	ОбработкаОбъект_ = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект_.ЗаполнитьДокументыДляРассылки();
	ЗначениеВРеквизитФормы(ОбработкаОбъект_, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьРассылкуНаСервере()
	
	РеквизитФормыВЗначение("Объект").ВыполнитьРассылку();
	
	ЗаполнитьТаблицуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	СохранитьНастройкиСервер();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиСервер()
	
	Попытка
		ТЗ = Объект.СписокПолучателей.Выгрузить();
	Исключение
		а=2;
	КонецПопытки;
	
	а=1;
	СтруктураНастроек = Новый Структура("ТЗАдресов, Тема, ГлубинаПроверки",ТЗ, Объект.ТемаПисьма, Объект.ГлубинаПроверки);
	ХранилищеОбщихНастроек.Сохранить("РассылкаОтпусков_676924","СтруктураНастроек", СтруктураНастроек,,"Пользователь_676924");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураНастроек = ХранилищеОбщихНастроек.Загрузить("РассылкаОтпусков_676924","СтруктураНастроек",,"Пользователь_676924");
	Попытка
		ТЗ = СтруктураНастроек.ТЗАдресов;
		Объект.СписокПолучателей.Очистить();
		Для каждого Стр Из ТЗ Цикл
			НовСтр = Объект.СписокПолучателей.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		КонецЦикла;
		Объект.ТемаПисьма = СтруктураНастроек.Тема;
		Объект.ГлубинаПроверки = СтруктураНастроек.ГлубинаПроверки;
	Исключение
	    //ОписаниеОшибки()
	КонецПопытки;
	
	
КонецПроцедуры

#КонецОбласти